Repository: ZekeriyaAY/track-finance
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: tr

source: Transaction added successfully!
tr: İşlem başarıyla eklendi!

source: An error occurred while adding the transaction.
tr: İşlem eklenirken bir hata oluştu.

source: Transaction updated successfully!
tr: İşlem başarıyla güncellendi!

source: An error occurred while updating the transaction.
tr: İşlem güncellenirken bir hata oluştu.

source: Transaction deleted successfully!
tr: İşlem başarıyla silindi!

source: An error occurred while deleting the transaction.
tr: İşlem silinirken bir hata oluştu.

source: Please select an Excel file.
tr: Lütfen bir Excel dosyası seçin.

source: Only Excel files (.xlsx, .xls, .csv) are supported.
tr: Sadece Excel dosyaları (.xlsx, .xls, .csv) desteklenmektedir.

source: Please select a bank.
tr: Lütfen bir banka seçin.

source: Errors:
tr: Hatalar:

source: An unexpected error occurred.
tr: Beklenmeyen bir hata oluştu.

source: This category already exists!
tr: Bu kategori zaten mevcut!

source: Category added successfully!
tr: Kategori başarıyla eklendi!

source: An error occurred while adding the category.
tr: Kategori eklenirken bir hata oluştu.

source: Category updated successfully!
tr: Kategori başarıyla güncellendi!

source: An error occurred while updating the category.
tr: Kategori güncellenirken bir hata oluştu.

source: This category has subcategories. You must delete them first!
tr: Bu kategorinin alt kategorileri var. Önce onları silmelisiniz!

source: This category has associated transactions and cannot be deleted.
tr: Bu kategoriye bağlı işlemler var ve silinemez.

source: Category deleted successfully!
tr: Kategori başarıyla silindi!

source: An error occurred while deleting the category.
tr: Kategori silinirken bir hata oluştu.

source: Investment transaction added successfully!
tr: Yatırım işlemi başarıyla eklendi!

source: An error occurred while adding the investment transaction.
tr: Yatırım işlemi eklenirken bir hata oluştu.

source: Investment transaction updated successfully!
tr: Yatırım işlemi başarıyla güncellendi!

source: An error occurred while updating the investment transaction.
tr: Yatırım işlemi güncellenirken bir hata oluştu.

source: Investment transaction deleted successfully.
tr: Yatırım işlemi başarıyla silindi.

source: An error occurred while deleting the investment transaction.
tr: Yatırım işlemi silinirken bir hata oluştu.

source: This investment type already exists!
tr: Bu yatırım türü zaten mevcut!

source: Investment type added successfully!
tr: Yatırım türü başarıyla eklendi!

source: An error occurred while adding the investment type.
tr: Yatırım türü eklenirken bir hata oluştu.

source: Investment type updated successfully!
tr: Yatırım türü başarıyla güncellendi!

source: An error occurred while updating the investment type.
tr: Yatırım türü güncellenirken bir hata oluştu.

source: This investment type has subtypes. You must delete them first!
tr: Bu yatırım türünün alt türleri var. Önce onları silmelisiniz!

source: This investment type has associated investments and cannot be deleted.
tr: Bu yatırım türüne bağlı yatırımlar var ve silinemez.

source: Investment type deleted successfully!
tr: Yatırım türü başarıyla silindi!

source: An error occurred while deleting the investment type.
tr: Yatırım türü silinirken bir hata oluştu.

source: Dummy data created successfully.
tr: Sahte veriler başarıyla oluşturuldu.

source: An error occurred while creating dummy data.
tr: Sahte veriler oluşturulurken bir hata oluştu.

source: Default categories created successfully.
tr: Varsayılan kategoriler başarıyla oluşturuldu.

source: An error occurred while creating default categories.
tr: Varsayılan kategoriler oluşturulurken bir hata oluştu.

source: Default tags created successfully.
tr: Varsayılan etiketler başarıyla oluşturuldu.

source: An error occurred while creating default tags.
tr: Varsayılan etiketler oluşturulurken bir hata oluştu.

source: Default investment types created successfully.
tr: Varsayılan yatırım türleri başarıyla oluşturuldu.

source: An error occurred while creating default investment types.
tr: Varsayılan yatırım türleri oluşturulurken bir hata oluştu.

source: Database data cleared successfully.
tr: Veritabanı verileri başarıyla temizlendi.

source: Error clearing database data.
tr: Veritabanı verileri temizlenirken hata oluştu.

source: This tag already exists!
tr: Bu etiket zaten mevcut!

source: Tag added successfully!
tr: Etiket başarıyla eklendi!

source: An error occurred while adding the tag.
tr: Etiket eklenirken bir hata oluştu.

source: Tag updated successfully!
tr: Etiket başarıyla güncellendi!

source: An error occurred while updating the tag.
tr: Etiket güncellenirken bir hata oluştu.

source: This tag has associated transactions and cannot be deleted.
tr: Bu etikete bağlı işlemler var ve silinemez.

source: Tag deleted successfully!
tr: Etiket başarıyla silindi!

source: An error occurred while deleting the tag.
tr: Etiket silinirken bir hata oluştu.

source: Cash Flow
tr: Nakit Akışı

source: Investments
tr: Yatırımlar

source: Grafana Analytics
tr: Grafana Analitiği

source: Management
tr: Yönetim

source: Categories
tr: Kategoriler

source: Tags
tr: Etiketler

source: Investment Types
tr: Yatırım Türleri

source: Settings
tr: Ayarlar

source: Edit Transaction
tr: İşlemi Düzenle

source: New Transaction
tr: Yeni İşlem

source: Add New Transaction
tr: Yeni İşlem Ekle

source: Go Back
tr: Geri Dön

source: Date
tr: Tarih

source: Amount
tr: Miktar

source: Transaction Type
tr: İşlem Türü

source: Income
tr: Gelir

source: Expense
tr: Gider

source: Category
tr: Kategori

source: Description
tr: Açıklama

source: Cancel
tr: İptal

source: Save
tr: Kaydet

source: Import your bank transactions from Excel files
tr: Banka işlemlerinizi Excel dosyalarından içe aktarın

source: Excel File
tr: Excel Dosyası

source: Supported formats: .xlsx, .xls, .csv
tr: Desteklenen formatlar: .xlsx, .xls, .csv

source: Bank
tr: Banka

source: Currently only Yapı Kredi is supported
tr: Şu anda sadece Yapı Kredi desteklenmektedir

source: Import Excel
tr: Excel'i İçe Aktar

source: Important Notice
tr: Önemli Uyarı

source: Import operation cannot be undone. Transactions will be created in "Import" category with bank tag.
tr: İçe aktarma işlemi geri alınamaz. İşlemler "Import" kategorisinde banka etiketi ile oluşturulacak.

source: How to Use?
tr: Nasıl Kullanılır?

source: Login to your Yapı Kredi Internet Banking
tr: Yapı Kredi İnternet Bankacılığına giriş yapın

source: Go to Account Summary menu
tr: Hesap Özeti menüsüne gidin

source: Select date range and click "Download Excel"
tr: Tarih aralığını seçin ve "Excel İndir" butonuna tıklayın

source: Upload the downloaded Excel file here
tr: İndirilen Excel dosyasını buraya yükleyin

source: Transactions will be automatically created in "Import" category
tr: İşlemler otomatik olarak "Import" kategorisinde oluşturulacak

source: You can edit categories and tags later
tr: Kategorileri ve etiketleri daha sonra düzenleyebilirsiniz

source: Please select a file.
tr: Lütfen bir dosya seçin.

source: Importing...
tr: İçe aktarılıyor...

source: Cashflow Transactions
tr: Nakit Akışı İşlemleri

source: Actions
tr: İşlemler

source: Edit
tr: Düzenle

source: Are you sure you want to delete this transaction?
tr: Bu işlemi silmek istediğinizden emin misiniz?

source: Delete
tr: Sil

source: No transactions found yet
tr: Henüz işlem bulunamadı

source: You can add a new transaction using the "New Transaction" button.
tr: "Yeni İşlem" butonunu kullanarak yeni bir işlem ekleyebilirsiniz.

source: Edit Category
tr: Kategoriyi Düzenle

source: Add New Category
tr: Yeni Kategori Ekle

source: Category Name
tr: Kategori Adı

source: Parent Category
tr: Üst Kategori

source: Main Category
tr: Ana Kategori

source: New Category
tr: Yeni Kategori

source: Income / Expense
tr: Gelir / Gider

source: Total Income
tr: Toplam Gelir

source: Total Expense
tr: Toplam Gider

source: Are you sure you want to delete this category?
tr: Bu kategoriyi silmek istediğinizden emin misiniz?

source: No categories found yet
tr: Henüz kategori bulunamadı

source: You can add a new category using the "New Category" button.
tr: "Yeni Kategori" butonunu kullanarak yeni bir kategori ekleyebilirsiniz.

source: Investment Type
tr: Yatırım Türü

source: Transaction Date
tr: İşlem Tarihi

source: Buy
tr: Alış

source: Sell
tr: Satış

source: Price
tr: Fiyat

source: Investment Transactions
tr: Yatırım İşlemleri

source: Quantity
tr: Miktar

source: Unit Price
tr: Birim Fiyat

source: Total Amount
tr: Toplam Tutar

source: Edit Investment Type
tr: Yatırım Türünü Düzenle

source: New Investment Type
tr: Yeni Yatırım Türü

source: Add New Investment Type
tr: Yeni Yatırım Türü Ekle

source: Type Name
tr: Tür Adı

source: Code
tr: Kod

source: Icon
tr: Simge

source: Font Awesome icon class
tr: Font Awesome simge sınıfı

source: Color
tr: Renk

source: Preview
tr: Önizleme

source: Parent Type
tr: Üst Tür

source: Main Type
tr: Ana Tür

source: New Type
tr: Yeni Tür

source: Number of Investments
tr: Yatırım Sayısı

source: Total Investments
tr: Toplam Yatırım

source: Are you sure you want to delete this investment type?
tr: Bu yatırım türünü silmek istediğinizden emin misiniz?

source: No investment types found yet
tr: Henüz yatırım türü bulunamadı

source: You can add a new investment type using the "New Type" button.
tr: "Yeni Tür" butonunu kullanarak yeni bir yatırım türü ekleyebilirsiniz.

source: Language
tr: Dil

source: Default Data
tr: Varsayılan Veri

source: Existing data will not be recreated, only missing data will be added.
tr: Mevcut veriler yeniden oluşturulmaz, sadece eksik olanlar eklenir.

source: Default Categories
tr: Varsayılan Kategoriler

source: Creates income and expense categories.
tr: Gelir ve gider kategorileri oluşturur.

source: Create Categories
tr: Kategorileri Oluştur

source: Default Tags
tr: Varsayılan Etiketler

source: Creates default tags to be used for tagging transactions.
tr: İşlemleri etiketlemek için varsayılan etiketler oluşturur.

source: Create Tags
tr: Etiketleri Oluştur

source: Default Investment Types
tr: Varsayılan Yatırım Türleri

source: Creates default investment types to categorize investments.
tr: Yatırımları kategorize etmek için varsayılan yatırım türleri oluşturur.

source: Create Investment Types
tr: Yatırım Türlerini Oluştur

source: Database Management
tr: Veritabanı Yönetimi

source: Dummy Data
tr: Sahte Veri

source: Creates default categories, tags, investment types and sample transactions.
tr: Varsayılan kategoriler, etiketler, yatırım türleri ve örnek işlemler oluşturur.

source: Create Dummy Data
tr: Sahte Veriyi Oluştur

source: Reset Database
tr: Veritabanını Sıfırla

source: Deletes all data and resets the database. This action cannot be undone!
tr: Tüm verileri siler ve veritabanını sıfırlar. Bu işlem geri alınamaz!

source: All data will be deleted! Are you sure about this action?
tr: Tüm veriler silinecek! Bu işlemden emin misiniz?

source: Edit Tag
tr: Etiketi Düzenle

source: Add Tag
tr: Etiket Ekle

source: Tag Name
tr: Etiket Adı

source: New Tag
tr: Yeni Etiket

source: Are you sure you want to delete this tag?
tr: Bu etiketi silmek istediğinizden emin misiniz?

source: No tags found yet
tr: Henüz etiket bulunamadı

source: You can add a new tag using the "New Tag" button.
tr: "Yeni Etiket" butonunu kullanarak yeni bir etiket ekleyebilirsiniz.

source: Grafana Settings
tr: Grafana Ayarları

source: Configure your Grafana dashboard URL for analytics.
tr: Analitik için Grafana pano URL'nizi yapılandırın.

source: Grafana URL
tr: Grafana URL'si

source: Update
tr: Güncelle

source: Enter the URL where your Grafana instance is running (e.g., http://localhost:3000)
tr: Grafana örneğinizin çalıştığı URL'yi girin (örneğin, http://localhost:3000)

source: Grafana URL cannot be empty.
tr: Grafana URL'si boş olamaz.

source: Grafana URL updated successfully.
tr: Grafana URL'si başarıyla güncellendi.

source: An error occurred while updating Grafana URL.
tr: Grafana URL'si güncellenirken bir hata oluştu.
